{
  "scenes": {
    "huntersOutpost": {
      "text": "After several days of travel, you arrive at the Hunter's Outpost - a ramshackle collection of buildings nestled in a small clearing in the forest. Smoke rises from chimneys, and you can hear the sound of hammers on anvils and the low murmur of conversation.\n\nAs you approach, several of the hunters look up from their work, eyeing you with suspicion. An older man with a grizzled beard and a scar across his cheek steps forward, hand resting on the axe at his belt.\n\n\"Strangers don't often come this far into the woods,\" he says, his voice rough as gravel. \"What business do you have at our outpost?\"",
      "choices": [
        {
          "text": "Tell him about the bear attacks and your mission",
          "nextScene": "explainMission"
        },
        {
          "text": "Ask about the strange bear behavior you've observed",
          "nextScene": "askAboutBears"
        },
        {
          "text": "Offer to trade supplies and information",
          "nextScene": "offerTrade",
          "requires": {
            "stat": {"charisma": 7}
          }
        }
      ]
    },
    "explainMission": {
      "text": "You explain that you've been sent to investigate the unusual bear attacks that have been plaguing nearby settlements. The grizzled hunter's expression grows serious as you speak.\n\n\"So they've finally sent someone,\" he mutters. \"Took them long enough.\" He studies you more carefully now, assessing your capabilities.\n\n\"Name's Harald,\" he says finally. \"I lead this outpost. We've been tracking these bears for months now. They're not natural - they're organized, almost like they have a purpose. Some of my best hunters went missing trying to find their lair.\"\n\nHe gestures for you to follow him to a large central tent. Inside, a crude map is spread across a table, with several locations marked in red.",
      "choices": [
        {
          "text": "Ask about the marked locations on the map",
          "nextScene": "askAboutMap"
        },
        {
          "text": "Inquire about the missing hunters",
          "nextScene": "askAboutMissingHunters"
        },
        {
          "text": "Request help for your mission",
          "nextScene": "requestHelp"
        }
      ]
    },
    "askAboutBears": {
      "text": "\"Strange bears?\" The hunter's eyes narrow. \"What exactly have you seen?\"\n\nYou describe the unusual behavior you've witnessed - bears walking on hind legs for extended periods, seemingly communicating with each other, using simple tools. With each detail, the hunter's expression grows darker.\n\n\"So it's true,\" he says quietly. \"Come with me.\"\n\nHe leads you to a small hut at the edge of the outpost. Inside, illuminated by a single lantern, is a bear skin stretched across the wall. But this is unlike any bear skin you've seen before. Strange symbols have been carved into the leather, and what appears to be a crude harness with pouches is laid out beneath it.\n\n\"Found this on one we managed to bring down last month,\" he explains. \"Never seen anything like it. The bear was wearing this harness, carrying supplies. Like a damn pack animal... or a soldier.\"",
      "choices": [
        {
          "text": "Ask if they've seen where these bears come from",
          "nextScene": "askOrigin"
        },
        {
          "text": "Examine the symbols on the bear skin",
          "nextScene": "examineSymbols"
        },
        {
          "text": "Inquire if anyone at the outpost might know more",
          "nextScene": "askAboutExperts"
        }
      ]
    },
    "offerTrade": {
      "text": "With a friendly smile and open hands, you suggest a mutual exchange of supplies and information that could benefit both parties. The hunter seems surprised by your approach, but your charismatic manner puts him at ease.\n\n\"Been a while since we've had a reasonable traveler come through,\" he says with a hint of respect. \"Name's Harald. I run this outpost.\"\n\nHe invites you to the trading post, a large tent filled with pelts, weapons, and various supplies. Other hunters gather around, curious about the newcomer willing to trade.\n\n\"So what have you got to offer?\" Harald asks, more amicable now. \"And what do you need to know about these woods?\"",
      "choices": [
        {
          "text": "Trade some of your supplies for information about the bears",
          "nextScene": "tradeForInformation"
        },
        {
          "text": "Offer to help hunt in exchange for a place to stay",
          "nextScene": "offerHunting"
        },
        {
          "text": "Ask if they need any specific items you might provide",
          "nextScene": "askNeeds"
        }
      ]
    },
    "askAboutMap": {
      "text": "You point to the red markings on the map. \"What are these locations?\"\n\nHarald traces a rough path between several of the marks. \"Bear sightings, but not normal ones. Each of these is where we've encountered the... changed ones. The bears that act different.\" His finger stops on a large circle deep in the mountains. \"And this is where we think they're coming from. Some kind of cave system in the Crystal Ridge Mountains.\"\n\nHe looks up at you grimly. \"Three hunting parties haven't returned from there. Whatever is happening, that's the source.\"\n\nThe map shows a difficult journey ahead - dense forest, rocky terrain, and several river crossings, all leading to a remote mountain range that few have explored.",
      "items": [
        {
          "id": "outpostMap",
          "name": "Hunter's Outpost Map",
          "description": "A detailed map showing the path to Crystal Ridge Mountains, with bear sighting locations marked in red.",
          "category": "key",
          "icon": "🗺️",
          "quantity": 1,
          "stackable": false
        }
      ],
      "choices": [
        {
          "text": "Ask about the best route to reach the mountains",
          "nextScene": "askBestRoute"
        },
        {
          "text": "Inquire if anyone has returned from the caves with information",
          "nextScene": "askAboutSurvivors"
        },
        {
          "text": "Ask to speak with anyone who's encountered the changed bears",
          "nextScene": "speakWithWitnesses"
        }
      ]
    },
    "askAboutMissingHunters": {
      "text": "\"What happened to your missing hunters?\" you ask.\n\nHarald's face darkens. \"Five parties we've sent to track these bears. Two came back with their numbers halved. Three never returned at all.\" He points to several names carved into a wooden post in the center of the tent.\n\n\"Good hunters, all of them. Experienced. Not the type to get lost or be careless.\" He looks at you meaningfully. \"Tomas returned with half his side torn open. Before he died, he said the bears didn't kill his companions. Said they were taken. Carried off still breathing.\"\n\nHe reaches into a chest and pulls out a broken crossbow. \"This belonged to Karina, one of our best trackers. Found it two weeks ago by the eastern stream, covered in blood. But no body. Never found any bodies.\"",
      "choices": [
        {
          "text": "Ask if Karina had any close friends or family here who might know more",
          "nextScene": "askAboutKarina"
        },
        {
          "text": "Inquire about the locations where the hunters disappeared",
          "nextScene": "askDisappearanceLocations"
        },
        {
          "text": "Offer to look for signs of the missing hunters during your journey",
          "nextScene": "offerToSearch"
        }
      ]
    },
    "requestHelp": {
      "text": "\"I'll need help if I'm going to get to the bottom of this,\" you tell Harald. \"Guides, supplies, maybe even some backup.\"\n\nHarald considers your request, stroking his beard thoughtfully. \"Not many are willing to venture far these days, not with what's happened to our hunting parties.\" He surveys the outpost through the tent flap.\n\n\"I can spare some supplies - food, basic equipment. As for guides...\" He hesitates. \"There's Karina's sister, Lyra. Nearly as good a tracker, but fiercer. She's been demanding to go after Karina since she disappeared. Might be good to have her along, if only to keep her from going off alone.\"\n\nHe turns back to you. \"As for backup, most here are needed to defend the outpost. But I know one who might join you. Erikson. Lost his brother to the bears. Handy with a bow, keeps to himself these days.\"",
      "choices": [
        {
          "text": "Accept Lyra's help as a guide",
          "nextScene": "recruitLyra"
        },
        {
          "text": "Seek out Erikson for combat support",
          "nextScene": "recruitErikson"
        },
        {
          "text": "Ask only for supplies, planning to go alone",
          "nextScene": "goAlone"
        }
      ]
    },
    "recruitLyra": {
      "text": "You decide to seek out Lyra, hoping her tracking skills and personal motivation will make her a valuable ally.\n\nHarald leads you to a small cabin at the edge of the outpost. A young woman with auburn hair tied back in a tight braid is sharpening a wicked-looking hunting knife. She looks up as you approach, her eyes hard and questioning.\n\n\"Lyra,\" Harald says, \"this traveler is investigating the bear attacks. Going to the Crystal Ridge.\"\n\nAt the mention of the ridge, Lyra's attention fully shifts to you. She stands, knife still in hand.\n\n\"Where my sister disappeared,\" she says. It's not a question. \"I've been ready to leave for weeks. Harald won't let me go alone.\"\n\nShe studies you carefully. \"You looking for help or looking to help? Because I'm going to find Karina, with or without you.\"",
      "choices": [
        {
          "text": "Tell her you want to find her sister too",
          "nextScene": "helpFindKarina"
        },
        {
          "text": "Be honest about your primary mission to investigate the bears",
          "nextScene": "focusOnBears"
        },
        {
          "text": "Suggest that finding her sister and your mission are likely connected",
          "nextScene": "connectMissions"
        }
      ]
    },
    "connectMissions": {
      "text": "\"I think our goals align,\" you tell Lyra carefully. \"Whatever's happening with these bears is connected to the disappearances. If we find one answer, we'll likely find the other.\"\n\nLyra considers this, testing the edge of her knife with her thumb. After a moment, she nods slowly.\n\n\"Sensible approach,\" she admits. \"Karina would say the same.\" She sheathes her knife and begins gathering equipment from around the cabin. \"I've been mapping sightings, tracking patterns. These aren't normal bears - they have territories, patrol routes, almost like...\"\n\n\"Like soldiers,\" Harald finishes for her.\n\n\"Exactly,\" Lyra says, pulling a small leather-bound journal from her pack and handing it to you. \"My sister's notes. She noticed it first. The bears are organized, and they're gathering something from the mountains. Some kind of crystal.\"",
      "items": [
        {
          "id": "karinasJournal",
          "name": "Karina's Journal",
          "description": "A detailed journal documenting unusual bear behavior patterns and references to crystals being gathered.",
          "category": "key",
          "icon": "📓",
          "quantity": 1,
          "stackable": false
        }
      ],
      "choices": [
        {
          "text": "Ask about the crystals mentioned in the journal",
          "nextScene": "askAboutCrystals"
        },
        {
          "text": "Suggest preparing to leave for Crystal Ridge immediately",
          "nextScene": "prepareForJourney"
        },
        {
          "text": "Ask if there's anyone else who should join your expedition",
          "nextScene": "askForMoreHelp"
        }
      ]
    },
    "askAboutCrystals": {
      "text": "You flip through Karina's journal, stopping at a page with a rough sketch of an unusual crystal formation. \"What are these crystals she mentions?\"\n\nLyra leans over to look at the page. \"No one knows for certain. Karina found a small one near a bear den.\" She reaches into a pouch at her belt and pulls out a crystal shard about the size of a finger. It glows with a faint blue light that seems to pulse like a heartbeat.\n\n\"It's warm to the touch,\" Lyra explains as she hands it to you. \"And the glow gets brighter at night. Karina thought the bears were collecting them for some reason. She was tracking a group that was carrying several larger pieces when she disappeared.\"\n\nAs you hold the crystal, you feel a strange sensation - a faint humming that seems to vibrate through your bones rather than your ears. For just a moment, you think you hear whispers at the edge of your consciousness.",
      "items": [
        {
          "id": "crystalShard",
          "name": "Glowing Crystal Shard",
          "description": "A small blue crystal that pulses with an inner light and feels warm to the touch. It seems to whisper at the edge of your perception.",
          "category": "key",
          "icon": "💎",
          "quantity": 1,
          "stackable": false,
          "effects": {
            "custom": "crystalVisions"
          }
        }
      ],
      "choices": [
        {
          "text": "Ask if anyone has studied the crystal's properties",
          "nextScene": "askCrystalProperties"
        },
        {
          "text": "Share the strange sensation you felt while holding it",
          "nextScene": "shareCrystalExperience"
        },
        {
          "text": "Suggest gathering supplies for the journey to Crystal Ridge",
          "nextScene": "gatherSupplies"
        }
      ]
    },
    "gatherSupplies": {
      "text": "\"We should prepare thoroughly before heading to Crystal Ridge,\" you suggest. \"What supplies will we need?\"\n\nLyra nods in agreement, already pulling equipment from various shelves and chests. \"The journey takes at least four days, longer if we're being cautious. We'll need food, water skins, climbing equipment for the steeper sections.\"\n\nHarald returns with a bundle of supplies. \"I've gathered what we can spare. Not as much as I'd like, but enough to get you there if you're careful.\"\n\nOver the next hour, you and Lyra organize the equipment, discussing the route and potential dangers. She's methodical and thorough, checking and double-checking each item before packing it away.\n\n\"Bear activity increases near the ridgeline,\" she explains, pointing to her map. \"We'll need to be especially careful here, where the forest thins out. Less cover for us, good visibility for them.\"",
      "items": [
        {
          "id": "travelRations",
          "name": "Travel Rations",
          "description": "Dried meat, hard bread, and preserved fruits. Enough for several days of travel.",
          "category": "consumable",
          "icon": "🍖",
          "quantity": 5,
          "effects": {
            "heal": 10
          }
        },
        {
          "id": "climbingGear",
          "name": "Climbing Equipment",
          "description": "Ropes, pitons, and other gear necessary for scaling the rocky terrain of Crystal Ridge.",
          "category": "key",
          "icon": "🧗",
          "quantity": 1,
          "stackable": false
        },
        {
          "id": "healingSalve",
          "name": "Hunter's Healing Salve",
          "description": "A potent mixture of herbs and tree sap that accelerates healing.",
          "category": "consumable",
          "icon": "🧪",
          "quantity": 2,
          "effects": {
            "heal": 25
          }
        }
      ],
      "choices": [
        {
          "text": "Ask if there are any weapons you should bring specifically for these bears",
          "nextScene": "askSpecialWeapons"
        },
        {
          "text": "Suggest leaving at first light tomorrow",
          "nextScene": "leaveAtDawn"
        },
        {
          "text": "Propose a final strategy meeting with Harald before departure",
          "nextScene": "strategyMeeting"
        }
      ]
    },
    "strategyMeeting": {
      "text": "As evening falls, you gather with Lyra and Harald around a large table in the main lodge. A fire crackles in the hearth, casting long shadows across the room as Harald unfolds a detailed map of the region.\n\n\"Crystal Ridge is treacherous even without bear patrols,\" Harald explains, tracing the route with a weathered finger. \"The obvious path through Eagle Pass will likely be watched. I'd suggest the longer route through Shadowvale. Less direct, but better cover.\"\n\nLyra points to several marked locations. \"My sister's last reports mentioned increased activity here, here, and here. They seem to be guarding these approaches most heavily.\"\n\nHarald nods grimly. \"Whatever they're protecting in those caves, they don't want anyone finding it.\" He looks up at you both. \"If you do make it inside, be prepared for anything. The few reports we have suggest the cave system is extensive.\"\n\nAs the meeting concludes, a strange sound echoes from the forest - a deep, bellowing roar unlike any bear you've heard before. Everyone in the lodge freezes, listening intently.",
      "choices": [
        {
          "text": "Ask what that sound was",
          "nextScene": "askAboutRoar"
        },
        {
          "text": "Suggest checking the perimeter defenses",
          "nextScene": "checkDefenses"
        },
        {
          "text": "Recommend everyone get rest for tomorrow's journey",
          "nextScene": "getRestForJourney"
        }
      ]
    },
    "askAboutRoar": {
      "text": "\"What was that?\" you ask, noting how everyone in the lodge has tensed.\n\nHarald's expression is grim. \"That's not a normal bear. We call it the Patriarch. Biggest bear anyone's ever seen, walks fully upright, and wears some kind of armor.\"\n\nLyra's hand moves to her knife. \"It's only been sighted three times. Each time, it was leading a group of the changed bears, like a commander. Two of those sightings preceded attacks on hunting parties.\"\n\n\"Then one was my sister's group,\" she adds quietly.\n\nHarald moves to a shuttered window, peering carefully through a crack. \"It's never come this close to the outpost before.\" He turns to the other hunters. \"Double the watch tonight. No one goes out alone.\"\n\nTo you and Lyra, he says more quietly, \"This might work in your favor. If the Patriarch is here, it's not guarding the caves. But you'll need to leave quietly, and soon.\"",
      "choices": [
        {
          "text": "Suggest leaving immediately under cover of darkness",
          "nextScene": "leaveImmediately"
        },
        {
          "text": "Offer to help defend the outpost if they're attacked",
          "nextScene": "offerDefense"
        },
        {
          "text": "Ask for more information about the Patriarch",
          "nextScene": "learnAboutPatriarch"
        }
      ]
    },
    "leaveImmediately": {
      "text": "\"If the Patriarch is here, we should use this opportunity,\" you say decisively. \"We can slip out now while their attention is focused on the outpost.\"\n\nLyra nods in agreement, already gathering her pack. \"The back trail through the western thicket. It's overgrown, but it will hide our passage.\"\n\nHarald looks concerned but doesn't argue. \"A bold move, but perhaps the right one.\" He quickly gathers additional supplies - a small lantern with a hood to control the light, a map with the secret paths marked, and a small pouch of what looks like crushed herbs.\n\n\"Bear repellent,\" he explains, handing you the pouch. \"Won't stop one that's charging, but might mask your scent if you're trying to stay hidden.\"\n\nWithin minutes, you and Lyra are ready. Harald leads you to a small gate in the rear palisade of the outpost. In the distance, another roar echoes through the trees, followed by answering calls from different directions.\n\n\"They're coordinating,\" Lyra whispers, a hint of fear in her otherwise steady voice.",
      "items": [
        {
          "id": "bearRepellent",
          "name": "Bear Repellent Herbs",
          "description": "A mixture of strong-smelling herbs that can help mask your scent from bears.",
          "category": "consumable",
          "icon": "🌿",
          "quantity": 3,
          "usable": true
        },
        {
          "id": "hoodedLantern",
          "name": "Hooded Lantern",
          "description": "A small oil lantern with adjustable shutters to control light output.",
          "category": "key",
          "icon": "🏮",
          "quantity": 1,
          "stackable": false
        }
      ],
      "choices": [
        {
          "text": "Head out immediately through the western thicket",
          "nextScene": "westernThicket"
        },
        {
          "text": "Take a moment to observe the bears' positions before leaving",
          "nextScene": "observeBears"
        },
        {
          "text": "Ask Harald if there's a contingency plan if you're discovered",
          "nextScene": "askContingency"
        }
      ]
    },
    "westernThicket": {
      "text": "You and Lyra slip through the small gate and immediately take cover in the dense underbrush. The night is moonless, making visibility poor but also helping to conceal your movement. Lyra moves with practiced stealth, guiding you through the thicket.\n\nThe dense vegetation claws at your clothing, and thorns scratch at exposed skin, but you press on, moving away from the outpost. Behind you, the sounds of bear calls continue, seemingly focused on the eastern side of the settlement.\n\nAfter an hour of careful progress, Lyra pauses, listening intently. \"We're clear of the immediate danger,\" she whispers, \"but we need to keep moving. Dawn is still hours away, and we want to be well into the valley before first light.\"\n\nShe consults her compass, then points ahead. \"Crystal Ridge lies that way. If we maintain this pace, we can reach the foothills by midday tomorrow.\"\n\nAs you resume your journey, a distant flash of blue light illuminates the forest briefly. It came from the direction you're headed.",
      "choices": [
        {
          "text": "Ask Lyra about the blue light",
          "nextScene": "askAboutBlueLight"
        },
        {
          "text": "Suggest moving toward the light to investigate",
          "nextScene": "moveTowardLight"
        },
        {
          "text": "Recommend avoiding the light and taking a different route",
          "nextScene": "avoidLight"
        }
      ]
    },
    "askAboutBlueLight": {
      "text": "\"What was that light?\" you whisper, pointing in the direction of the brief blue flash.\n\nLyra's expression is grim in the dim glow of your hooded lantern. \"The crystals,\" she says quietly. \"Sometimes they pulse like that, but I've never seen one that bright before. Must be something much larger than the shards we've found.\"\n\nShe pulls out Karina's journal, flipping to a page by the lantern's faint light. \"My sister wrote about this. The bears gather at sites where the crystals pulse. She thought they might be... communicating with something through them.\"\n\nLyra closes the journal, looking troubled. \"Whatever that light is, it's between us and Crystal Ridge. We'll need to be extremely careful.\"\n\nAnother flash illuminates the forest, closer this time, casting eerie blue shadows among the trees. In the momentary light, you catch glimpses of movement - large shapes moving through the forest in the distance.",
      "choices": [
        {
          "text": "Suggest finding a vantage point to observe safely",
          "nextScene": "findVantagePoint"
        },
        {
          "text": "Recommend circling around to avoid the activity",
          "nextScene": "circleAround"
        },
        {
          "text": "Propose hiding and waiting until whatever is happening concludes",
          "nextScene": "hideAndWait"
        }
      ]
    },
    "circleAround": {
      "text": "\"We should avoid that activity completely,\" you whisper. \"Let's circle around and find another path.\"\n\nLyra considers this, then nods. \"Prudent. We don't know what we're dealing with, and getting captured won't help Karina.\"\n\nShe consults her map, tracing an alternate route with her finger. \"It will add half a day to our journey, but there's a ravine to the south that could provide cover.\"\n\nYou begin your detour, moving carefully through the increasingly dense forest. The terrain becomes challenging - fallen logs, tangled underbrush, and in places, marshy ground that threatens to swallow your boots. Despite the difficulties, you push on, always keeping the distant flashes of blue light to your right.\n\nAfter several exhausting hours, you reach the ravine Lyra mentioned. It cuts deeply into the landscape, with steep sides covered in loose rocks and stubborn vegetation. At the bottom, a small stream gurgles softly.\n\n\"We follow this downstream,\" Lyra explains, beginning her careful descent. \"It eventually curves back toward the ridge, but well away from whatever activity we saw.\"",
      "choices": [
        {
          "text": "Begin descending into the ravine",
          "nextScene": "descendRavine"
        },
        {
          "text": "Scan the ravine for any signs of bears before descending",
          "nextScene": "scanRavine"
        },
        {
          "text": "Ask Lyra if there are any hazards you should know about",
          "nextScene": "askRavineHazards"
        }
      ]
    },
    "scanRavine": {
      "text": "Before committing to the descent, you carefully scan the ravine for any signs of bear activity or other dangers. The pre-dawn light is still faint, but enough to make out the general features below.\n\n\"Smart,\" Lyra whispers, following your gaze. \"Never hurts to check.\"\n\nAs your eyes adjust, you notice several important details. The ravine appears clear of large predators, but you spot what looks like animal tracks along the stream bank. They're not bear prints - they're too small, more like deer or wild goats.\n\nYou also note a small waterfall about a quarter-mile downstream, with what appears to be a cave opening behind it. Near the cave, something catches your eye - a faint, unnatural shape partially hidden by brush.\n\n\"Lyra,\" you whisper, pointing. \"By the waterfall. Is that...?\"\n\nShe squints, then her breath catches. \"A pack. That's a hunter's pack.\" Her voice becomes urgent. \"We need to check that out.\"",
      "choices": [
        {
          "text": "Agree to investigate the pack immediately",
          "nextScene": "investigatePack"
        },
        {
          "text": "Suggest approaching cautiously in case it's a trap",
          "nextScene": "approachCautiously"
        },
        {
          "text": "Recommend watching the area for a while before going down",
          "nextScene": "observeRavine"
        }
      ]
    },
    "investigatePack": {
      "text": "\"Let's check it out,\" you decide. \"It could be from one of the missing hunters.\"\n\nLyra nods grimly, her face a mixture of hope and apprehension. \"It might be Karina's.\"\n\nYou begin your descent into the ravine, careful to maintain solid footing on the steep slope. The loose rocks and dirt make for treacherous going, but you manage to pick your way down without incident.\n\nAt the bottom, you follow the stream toward the waterfall. As you draw closer, the rush of falling water grows louder, creating a natural sound barrier that would mask any approaching danger. You remain vigilant, scanning your surroundings constantly.\n\nFinally, you reach the abandoned pack. It's weathered and partially covered by vegetation, suggesting it's been here for some time. Lyra kneels beside it, hands trembling slightly as she turns it over.\n\n\"It's Erikson's brother's pack,\" she says, voice tight with emotion. \"Not Karina's, but... one of the missing hunters.\" She carefully opens the main compartment, revealing sodden supplies, a broken compass, and a leather-bound journal protected in a waxed canvas wrapper.",
      "items": [
        {
          "id": "huntersJournal",
          "name": "Sodden Hunter's Journal",
          "description": "A partially water-damaged journal belonging to one of the missing hunters. Many pages are still readable.",
          "category": "key",
          "icon": "📔",
          "quantity": 1,
          "stackable": false
        }
      ],
      "choices": [
        {
          "text": "Examine the journal immediately",
          "nextScene": "readJournal"
        },
        {
          "text": "Check the cave behind the waterfall",
          "nextScene": "exploreWaterfallCave"
        },
        {
          "text": "Look for tracks or signs of what happened to the hunter",
          "nextScene": "searchForTracks"
        }
      ]
    },
    "readJournal": {
      "text": "You carefully open the journal, mindful of its fragile, water-damaged state. Many pages are ruined, the ink blurred beyond recognition, but portions remain legible. You flip through it, scanning for useful information.\n\n\"Listen to this,\" you say to Lyra, reading aloud from one of the intact entries:\n\n\"Day 8: Found more of the blue crystals today. They're growing more common as we approach the ridge. Jens tried to break one off - said it might fetch good coin back at the settlement. Burned his hand something fierce. The crystals don't like being touched.\"\n\nFlipping forward several pages:\n\n\"Day 12: Bears everywhere. Not attacking, just... watching. Following. They don't move like normal bears. Torben says we should turn back. I agree, but Karina insists we continue. She's obsessed with finding the source of the crystals.\"\n\nThe final legible entry sends a chill down your spine:\n\n\"Day 15: Cave entrance located. Massive crystal formation inside, lighting everything blue. Bears are gathered around it, standing like men. There's something else in there, moving among them. Not a bear. Not human either. Karina went to get a closer look. It's been hours. I'm going to find her. If anyone reads this, tell Erikson his brother wasn't a coward.\"",
      "choices": [
        {
          "text": "Share what you've read with Lyra",
          "nextScene": "discussJournalWithLyra"
        },
        {
          "text": "Examine the cave behind the waterfall",
          "nextScene": "exploreWaterfallCave"
        },
        {
          "text": "Check the surrounding area for more clues",
          "nextScene": "searchAreaForClues"
        }
      ]
    },
    "discussJournalWithLyra": {
      "text": "You show Lyra the journal entries, watching her face carefully as she reads. Her expression shifts from hope to concern to grim determination.\n\n\"This confirms what Karina suspected,\" she says finally, closing the journal. \"Something is controlling these bears, using them. And it's connected to the crystals.\"\n\nShe points to the entry about the cave. \"This must be a smaller entrance to the same cave system. The main entrance is on the ridge, but this could be a back way in.\" Her voice drops to a near whisper. \"And Karina was alive at least until fifteen days ago.\"\n\nLyra stares at the waterfall, the cave entrance partially visible behind the curtain of water. \"My sister went in there looking for answers. So will I.\" She turns to you, her face set with determination. \"But I understand if you want to continue to the main entrance as planned. This could be dangerous.\"\n\nThe sky has lightened to a pre-dawn gray. Decision time.",
      "choices": [
        {
          "text": "Suggest exploring this cave entrance together",
          "nextScene": "enterCaveTogether"
        },
        {
          "text": "Recommend continuing to the main entrance as planned",
          "nextScene": "continueToMainEntrance"
        },
        {
          "text": "Propose splitting up - you take one entrance, she takes the other",
          "nextScene": "suggestSplittingUp"
        }
      ]
    },
    "enterCaveTogether": {
      "text": "\"We should explore this entrance together,\" you decide. \"It might give us a tactical advantage to come in from an unexpected direction.\"\n\nLyra looks relieved at your decision. \"Thank you. I... I wouldn't have wanted to go alone, but I would have.\"\n\nYou approach the waterfall carefully. The roar of falling water grows louder, and a fine mist dampens your clothing. The cave entrance is partially obscured, but definitely large enough to enter without difficulty. The stone around the opening has an unusual quality - smooth striations that don't look naturally formed.\n\n\"Those look like claw marks,\" Lyra observes. \"But enormous, and methodical. Like the cave was... excavated.\"\n\nAs you step closer to the entrance, a faint blue glow becomes visible from deep within. It pulses slowly, like a heartbeat, illuminating the tunnel that leads downward into the earth. The air coming from the cave mouth is surprisingly warm and carries a strange metallic scent.\n\n\"Be ready for anything,\" you caution, checking your equipment one last time before proceeding.\n\nLyra nods, drawing her hunting knife. \"For Karina,\" she whispers, and steps into the cave.",
      "nextScene": "crystalCavesStart"
    }
  }
}