{
    "scenes": {
      "forestPath": {
        "text": "As you venture deeper into the forest, the canopy overhead grows thicker, filtering out most of the sunlight. The air feels heavy and damp. Strange sounds emanate from the undergrowth around you.\n\nYou pause, sensing something is wrong. The forest has gone eerily quiet. Suddenly, you hear a low growl from behind a thick cluster of trees ahead.",
        "choices": [
          { 
            "text": "Approach cautiously, weapon ready", 
            "nextScene": "bearEncounter",
            "requires": {
              "stat": {"speed": 6}
            }
          },
          { 
            "text": "Try to circle around", 
            "nextScene": "circleAround",
            "requires": {
              "stat": {"luck": 7}
            }
          },
          { 
            "text": "Charge in with a battle cry", 
            "nextScene": "bearEncounterSurprise" 
          }
        ]
      },
      "bearEncounter": {
        "text": "You approach carefully, keeping your footsteps light. As you near the cluster of trees, you see it - a bear, but unlike any you've seen before. It stands nearly seven feet tall, with unnatural red gleaming eyes. Its fur is matted with what looks like war paint, and a crude necklace of bones hangs around its neck.\n\nThe bear hasn't noticed you yet. You have the advantage of surprise.",
        "combat": {
          "enemy": {
            "name": "Forest Bear Warrior",
            "health": 80,
            "attack": 12,
            "description": "A bear that walks upright and wears primitive decorations. Its eyes glow with unnatural intelligence."
          },
          "nextScene": "afterBearVictory",
          "defeatScene": "bearDefeat"
        }
      },
      "bearEncounterSurprise": {
        "text": "With a mighty battle cry, you charge toward the source of the growl. The bear - a massive creature with strange markings and glowing red eyes - is startled but quickly recovers. It rises to its full height, nearly seven feet tall, and roars in challenge.\n\nYour reckless approach has put you at a disadvantage as the bear prepares to attack.",
        "combat": {
          "enemy": {
            "name": "Forest Bear Warrior",
            "health": 80,
            "attack": 15,
            "description": "A bear that walks upright and wears primitive decorations. Its eyes glow with unnatural intelligence."
          },
          "nextScene": "afterBearVictory",
          "defeatScene": "bearDefeat"
        }
      },
      "circleAround": {
        "text": "You decide to avoid direct confrontation and carefully circle around through the dense undergrowth. Fortune smiles upon you - the bear seems distracted by something else and doesn't notice your presence.\n\nAs you move quietly through the forest, you spot something unusual: a small clearing where several bears appear to be gathered in some kind of ceremony. They stand upright in a circle around a glowing blue crystal. You can observe unseen from your vantage point.",
        "choices": [
          { "text": "Continue watching the bears", "nextScene": "observeCeremony" },
          { "text": "Try to get closer to hear what they're saying", "nextScene": "listenToBears" },
          { "text": "Leave quietly and continue your journey", "nextScene": "leaveQuietly" }
        ]
      },
      "observeCeremony": {
        "text": "You remain hidden and observe the strange gathering. The bears seem to be communicating through a series of grunts and gestures. The largest bear, wearing an elaborate headdress of bones and feathers, places both paws on the crystal, which pulses with energy.\n\nA blinding flash of blue light erupts from the crystal, momentarily illuminating the clearing. When your vision clears, you notice that the bears now seem... different. More upright. More intelligent. The transformation is subtle but unmistakable.\n\nYou've witnessed something few humans have ever seen - the source of the bears' unnatural abilities.",
        "items": [
          {
            "id": "bearRitual",
            "name": "Bear Ritual Knowledge",
            "description": "You've witnessed the ceremony that transforms ordinary bears into intelligent warriors. This knowledge could be valuable.",
            "category": "key",
            "icon": "📜",
            "quantity": 1,
            "stackable": false
          }
        ],
        "choices": [
          { "text": "Leave while they're distracted", "nextScene": "safeReturn" },
          { "text": "Try to steal a fragment of the crystal", "nextScene": "stealCrystal" }
        ]
      },
      "listenToBears": {
        "text": "Your curiosity gets the better of you. You creep closer, taking cover behind a fallen log just outside the clearing. To your astonishment, you can understand fragments of what the bears are saying - not in any human language, but somehow the meaning transfers directly to your mind.\n\n'The human villages... expanding too far... must protect the sacred sites...' says one bear.\n\n'The crystals grow weaker... need more carriers...' responds another.\n\nSuddenly, your foot slips on wet moss. A twig snaps beneath your weight. The bears' heads snap in your direction.",
        "combat": {
          "enemy": {
            "name": "Bear Shaman",
            "health": 100,
            "attack": 18,
            "description": "A powerful bear wearing a ceremonial headdress. It channels strange energies from the crystal.",
            "loot": [
              {
                "id": "shamanHeaddress",
                "name": "Bear Shaman Headdress",
                "description": "A ceremonial headdress made of bones, feathers, and small crystal fragments. It hums with strange energy.",
                "category": "key",
                "icon": "👑",
                "quantity": 1,
                "stackable": false
              }
            ]
          },
          "nextScene": "shamanDefeated",
          "defeatScene": "bearCaptive"
        }
      },
      "afterBearVictory": {
        "text": "The bear warrior falls with a final, almost human-like groan. As its body hits the ground, you notice something unusual - a small blue crystal embedded in the fur at the back of its neck. The crystal pulses faintly, then grows dim.\n\nThis must be related to their strange intelligence and behavior. You carefully extract the crystal from the bear's fur. It's warm to the touch and occasionally emits a faint blue glow.",
        "items": [
          {
            "id": "bearCrystal",
            "name": "Strange Crystal",
            "description": "A small blue crystal that seems to pulse with energy. It was embedded in the bear's neck, possibly the source of its intelligence.",
            "category": "key",
            "icon": "💎",
            "quantity": 1,
            "stackable": false
          }
        ],
        "choices": [
          { "text": "Examine the crystal more closely", "nextScene": "examineCrystal" },
          { "text": "Continue on your journey", "nextScene": "continueJourney" }
        ]
      },
      "examineCrystal": {
        "text": "You hold the crystal up to the filtered sunlight. Within its translucent blue depths, you can see tiny flecks of light moving like stars in a miniature sky. As you turn it in your hand, a strange sensation washes over you - brief flashes of memory that aren't your own.\n\nA vast cavern... larger crystals glowing in the darkness... bears gathered around them in reverence... humans in hooded robes working alongside the bears...\n\nThe vision fades, leaving you with more questions than answers. But one thing is clear - these bears aren't just animals. They're part of something much bigger, possibly an ancient alliance or ritual that has been corrupted over time.",
        "choices": [
          { "text": "Pocket the crystal and continue your journey", "nextScene": "continueJourney" }
        ]
      },
      "bearDefeat": {
        "text": "The world spins as you fall to the ground, your strength fading. The bear looms over you, its red eyes studying you with unexpected intelligence. Instead of finishing you off, it makes a series of grunting noises that almost sound like speech.\n\nAnother bear emerges from the trees, this one wearing what looks like a primitive headdress made of bones and feathers. It examines you briefly, then makes a gesture. The warrior bear picks you up roughly.\n\nAs consciousness fades, you realize you're being taken somewhere. Your fate now lies in the paws of these strangely intelligent creatures.",
        "choices": [
          { "text": "Give in to unconsciousness", "nextScene": "bearCaptive" }
        ]
      },
      "bearCaptive": {
        "text": "You awaken in a dim cave, your wounds roughly bandaged with leaves and some kind of herbal paste. The throbbing pain has subsided to a dull ache. Your weapons and equipment have been removed, but surprisingly, you're not bound in any way.\n\nTorches made of pitch-soaked branches illuminate the cave walls, revealing crude drawings depicting bears and humans. Some scenes show cooperation, others conflict. In the center of the cave stands a large blue crystal formation, pulsing with gentle light.\n\nA bear wearing an elaborate headdress watches you from the shadows.",
        "choices": [
          { 
            "text": "Try to communicate with the bear", 
            "nextScene": "communicateWithShaman",
            "requires": {
              "stat": {"charisma": 7}
            }
          },
          { "text": "Look for an escape route", "nextScene": "lookForEscape" },
          { "text": "Examine the crystal more closely", "nextScene": "examineBigCrystal" }
        ]
      }
    }
  }